docs/enum_win32_diskdrive_req.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:b="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd">
    <s:Header>
        <a:To>http://smnnovmsfs01:5985/wsman</a:To>
        <w:ResourceURI s:mustUnderstand="true">http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/win32_diskdrive</w:ResourceURI>
        <a:ReplyTo>
            <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
        </a:ReplyTo>
        <a:Action s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/enumeration/Enumerate</a:Action>
        <w:MaxEnvelopeSize s:mustUnderstand="true">512000</w:MaxEnvelopeSize>
        <a:MessageID>uuid:F7001EF7-6F3A-4A4C-A84B-97C3234529F8</a:MessageID>
        <w:Locale xml:lang="en-US" s:mustUnderstand="false" />
        <p:DataLocale xml:lang="en-US" s:mustUnderstand="false" />
        <p:SessionId s:mustUnderstand="false">uuid:72F2092F-FF59-4FF6-8636-2B4508C7D42B</p:SessionId>
        <p:OperationID s:mustUnderstand="false">uuid:252F987F-4C09-4A43-90FF-361F1416F49D</p:OperationID>
        <p:SequenceId s:mustUnderstand="false">1</p:SequenceId>
        <w:SelectorSet>
            <w:Selector Name="__cimnamespace">root/cimv2</w:Selector>
        </w:SelectorSet>
        <w:OptionSet xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <w:Option Name="__MI_CallbackRegistration" Type="xs:int">11</w:Option>
            <w:Option Name="wmiarray:__MI_OPERATIONOPTIONS_CHANNELVALUE" Type="xs:unsignedInt">0</w:Option>
            <w:Option Name="wmiarray:__MI_OPERATIONOPTIONS_CHANNELVALUE" Type="xs:unsignedInt">1</w:Option>
            <w:Option Name="wmiarray:__MI_OPERATIONOPTIONS_CHANNELVALUE" Type="xs:unsignedInt">2</w:Option>
            <w:Option Name="wmi:__MI_OPERATIONOPTIONS_WRITEERRORMODE" Type="xs:unsignedInt">1</w:Option>
            <w:Option Name="msftwinrm:UsePreciseArrays" Type="xs:boolean">true</w:Option>
        </w:OptionSet>
    </s:Header>
    <s:Body>
        <n:Enumerate>
            <w:OptimizeEnumeration />
            <w:MaxElements>32000</w:MaxElements>
            <w:EnumerationMode>EnumerateObjectAndEPR</w:EnumerationMode>
        </n:Enumerate>
    </s:Body>
</s:Envelope>